{"meridian bioscience inc.": 0, "ceco environmental corp.": 1, "irras": 2, "powell industries": 3, "theravance biopharma inc.": 4, "the law offices of vincent wong": 5, "qilian international holding group limited": 6, "mercato partners": 7, "liminal biosciences inc.": 8, "realty income corporation": 9, "karisma hotels  resorts": 10, "ebet inc.": 11, "pacifico acquisition corp.": 12, "charles  colvard ltd.": 13, "tucows inc.": 14, "bed bath  beyond inc.": 15, "csi compressco lp": 16, "wounded warrior project": 17, "bank first corporation": 18, "professional fighters league pfl": 19, "urban one inc.": 20, "biostl": 21, "halo collective inc.": 22, "pollard banknote limited": 23, "pharming group nv": 24, "wax center partners": 25, "st bank": 26, "hawaiian airlines": 27, "renew energy global plc": 28, "simply business": 29, "liveperson inc.": 30, "lipogems": 31, "casterra ag ltd.": 32, "ever__glory international group inc": 33, "stealth biotherapeutics inc.": 34, "nuance communications inc.": 35, "mirati therapeutics inc.": 36, "paycor": 37, "blockchain capital": 38, "biolase inc.": 39, "syndax pharmaceuticals inc.": 40, "the vitamin shoppe": 41, "the gross law firm": 42, "vinco ventures": 43, "ucommune international ltd": 44, "douyu international holdings limited": 45, "infobird co. ltd": 46, "penn america energy": 47, "umpqua bank": 48, "reto eco__solutions inc.": 49, "mind medicine mindmed inc.": 50, "ccv": 51, "capow": 52, "mondelz international": 53, "theseus pharmaceuticals": 54, "ptc therapeutics inc.": 55, "neurocrine biosciences inc.": 56, "the9 limited": 57, "cantargia ab": 58, "noodles  company": 59, "fenics software limited": 60, "kintara therapeutics": 61, "aif institute": 62, "sparx technology inc.": 63, "heliospectra": 64, "marriott international in the caribbean and latin america": 65, "sopra steria": 66, "nuvalent inc.": 67, "ddamanda": 68, "qualsights": 69, "magyar bancorp": 70, "mgp ingredients inc.": 71, "personalizationmall.com": 72, "exacta systems": 73, "spearline": 74, "summit financial group inc.": 75, "greater commercial lending": 76, "zillow home loans": 77, "wix.com ltd.": 78, "swk holdings corporation": 79, "sectra": 80, "lichen china limited": 81, "chronograph": 82, "first financial bancorp.": 83, "klx energy services holdings inc.": 84, "cno financial group": 85, "eetimes taiwan and edn taiwan": 86, "steelcloud llc": 87, "unique logistics international inc.": 88, "up fintech holding limited": 89, "american advertising federation": 90, "boost mobile": 91, "horizon space acquisition i corp.": 92, "novavax inc.": 93, "novacharge": 94, "ease": 95, "glancy prongay  murray llp": 96, "wemade co. ltd": 97, "vidaa": 98, "paypal holdings inc.": 99, "trimble": 100, "maximum entertainment": 101, "francescas": 102, "st bancorp inc.": 103, "accuray incorporated": 104, "aurora technology acquisition corp.": 105, "pf industries inc.": 106, "liquidity services": 107, "ecarx holdings inc.": 108, "viavi financials": 109, "super micro computer inc.": 110, "pixelworks inc.": 111, "lucid diagnostics": 112, "quantum corp.": 113, "collplant": 114, "ceragon networks ltd.": 115, "caris life sciences": 116, "regenxbio inc.": 117, "alkami technology inc.": 118, "mestag therapeutics": 119, "minerva intelligence inc.": 120, "gse systems inc.": 121, "amci acquisition corp. ii": 122, "coinshares group": 123, "nofraud": 124, "creative medical technology holdings inc.": 125, "royal commission for alula": 126, "enteris biopharma inc.": 127, "match group": 128, "burning rock": 129, "genprex inc.": 130, "nextnav": 131, "core scientific inc.": 132, "santa cruz county bank": 133, "quiq": 134, "ucla anderson forecast": 135, "menarini industrie farmaceutiche riunite": 136, "echostar corporation": 137, "infinite reality": 138, "pepsico inc.": 139, "duff  phelps utility and infrastructure fund inc.": 140, "huatai international private equity fund htpe": 141, "warner bros. home entertainment": 142, "shryne group inc.": 143, "the gatorade company": 144, "cafemedia": 145, "bilibili manhua": 146, "finboa": 147, "ex.co": 148, "senstar technologies ltd.": 149, "purple innovation inc.": 150, "wedge": 151, "ginkgo bioworks": 152, "pierre fabre atara": 153, "united airlines": 154, "mgm resorts international": 155, "southern first bancshares inc.": 156, "tecsys inc.": 157, "palo alto networks inc.": 158, "rategain": 159, "macrometa": 160, "oxe marine ab": 161, "honeywell": 162, "duke energy": 163, "duni ab": 164, "sohu.com limited": 165, "corium pharma solutions inc.": 166, "eastbanc technologies": 167, "origin agritech limited": 168, "ey": 169, "day zero diagnostics inc.": 170, "marpai": 171, "simmons bank simmons first national corporation": 172, "peeking duck studios": 173, "caverion": 174, "syniti": 175, "swedish orphan biovitrum ab": 176, "bny mellon": 177, "bronstein gewirtz  grossman llc": 178, "neodynamics": 179, "aviat networks inc.": 180, "synopsys inc.": 181, "first us bancshares inc.": 182, "t__mobile samsara luggage inc.": 183, "calyxt inc.": 184, "retailmenot": 185, "kl acquisition corp": 186, "jazz pharmaceuticals plc": 187, "peoples financial services corp.": 188, "sscenfr": 189, "cognizant": 190, "logicgate": 191, "singlepoint inc.": 192, "biolinerx": 193, "iqiyi": 194, "clarendon private llc": 195, "valmet oyj": 196, "nielsen": 197, "bose corporation": 198, "carisma therapeutics inc.": 199, "sorrento therapeutics inc.": 200, "samsara luggage inc.": 201, "peloton interactive": 202, "virtus global multi__sector income fund": 203, "chemotech": 204, "nava health and vitality center": 205, "panacea financial": 206, "securitas": 207, "wavemax": 208, "logicbio therapeutics inc.": 209, "qualtek llc": 210, "lanvin group": 211, "armata pharmaceuticals inc.": 212, "concertai": 213, "moomoo technologies inc.": 214, "esquire financial holdings inc.": 215, "svf investment corp.": 216, "skipify": 217, "vanda pharmaceuticals inc.": 218, "ultra clean holdings inc.": 219, "cti towers inc.": 220, "comcast": 221, "digital turbine inc.": 222, "first citizens bank": 223, "association for enterprise opportunity": 224, "ardelyx": 225, "brainstorm cell therapeutics inc.": 226, "skanska": 227, "travelzoo": 228, "x llc": 229, "internet ecosystem innovation committee ieic": 230, "discovery life sciences": 231, "regulus therapeutics inc.": 232, "columbia banking system inc": 233, "wesbanco inc.": 234, "svb financial group": 235, "goldman sachs asset management lane partners beacon capital partners": 236, "tesspay inc.": 237, "columbia bank": 238, "cti biopharma corp.": 239, "citius pharmaceuticals inc.": 240, "tuanche limited": 241, "energy fuels inc.": 242, "unitedmasters": 243, "relmada therapeutics inc.": 244, "lightwave logic inc.": 245, "local bounti": 246, "mmtec inc.": 247, "poseida therapeutics inc.": 248, "lockheed martin": 249, "national association of investorsbetterinvesting": 250, "red robin": 251, "charter communications inc.": 252, "inter": 253, "creatd inc.": 254, "zillow": 255, "nyx professional makeup": 256, "sierra lake acquisition corp": 257, "grafbase": 258, "acuity trading": 259, "icf": 260, "powerbridge technologies co. ltd.": 261, "uber freight": 262, "spartan radar": 263, "catena media": 264, "brown gibbons lang  company": 265, "ohio valley banc corp.": 266, "the inx digital company inc.": 267, "pickleball kingdom": 268, "zyversa therapeutics inc.": 269, "roc energy acquisition corp.": 270, "provention bio inc.": 271, "icecure medical": 272, "bank of south carolina corporation": 273, "guardknox": 274, "taylor devices inc.": 275, "first advantage": 276, "sterling": 277, "36kr": 278, "rci hospitality holdings inc.": 279, "redhill biopharma ltd.": 280, "p101 sgr press office": 281, "akumin inc.": 282, "interlink electronics": 283, "tradezero": 284, "storytel": 285, "the ritz__carlton south beach": 286, "hawaiian holdings inc.": 287, "mycronic ab": 288, "hammerhead energy inc.": 289, "longevity biomedical": 290, "solos": 291, "zinzino": 292, "appfire": 293, "hedera": 294, "reynolds wrap": 295, "alterity therapeutics": 296, "quotient sciences": 297, "enlight renewable energy": 298, "nuzee": 299, "newmark group inc.": 300, "keurig dr pepper inc. nutrabolt": 301, "renren inc.": 302, "court tv": 303, "blackbaud inc.": 304, "keymed": 305, "hireez": 306, "caravelle international group": 307, "biolife solutions inc.": 308, "ross stores inc.": 309, "scripps": 310, "swedish stirling": 311, "sigma lithium": 312, "g fuel": 313, "eli lilly and company": 314, "parke bancorp inc.": 315, "swedish match": 316, "movano": 317, "lee pharmaceuticals": 318, "u.s. gold corp.": 319, "gogo inc.": 320, "quaker houghton": 321, "viavi solutions": 322, "1__800__flowers.com": 323, "autodesk inc.": 324, "african agriculture inc.": 325, "involta llc": 326, "equinix inc.": 327, "lipidio pharmaceuticals inc.": 328, "playa management usa llc": 329, "savvy ladies": 330, "china natural resources inc.": 331, "celsius holdings inc.": 332, "docusign inc.": 333, "coeptis therapeutics": 334, "partner communications company ltd.": 335, "hycroft mining holding corporation": 336, "netflix inc.": 337, "gogo business aviation": 338, "arcellx inc.": 339, "pr newswire": 340, "mysize": 341, "jabra": 342, "acelrx pharmaceuticals inc.": 343, "jx luxventure limited": 344, "stand up to cancer": 345, "nexgel": 346, "columbia banking system inc.": 347, "shareholders foundation inc.": 348, "fastway engineering": 349, "biostage inc.": 350, "amerco": 351, "accelerate diagnostics inc.": 352, "lucara diamond corp.": 353, "betterware de mxico s.a.b. de c.v.": 354, "selective insurance group inc.": 355, "tyra biosciences": 356, "mercantile bank corporation": 357, "bloomerang": 358, "sinch": 359, "volvo": 360, "captain morgan": 361, "camden national corporation": 362, "trip.com group limited": 363, "wolf haldenstein adler freeman  herz llp": 364, "aflac incorporated": 365, "hometown food company": 366, "blueprint medicines corporation": 367, "pioneer power solutions inc.": 368, "hamilton lane": 369, "rhinebeck bancorp inc.": 370, "gaia inc.": 371, "castellum": 372, "36kr holdings inc.": 373, "home partners of america": 374, "targus": 375, "coupa software": 376, "purcell  lefkowitz llp": 377, "9f inc.": 378, "aurora cannabis inc.": 379, "adjust": 380, "matillion": 381, "couchbase inc.": 382, "cryoport inc.": 383, "bounce": 384, "digital brands group inc.": 385, "pop culture group co. ltd": 386, "research solutions inc.": 387, "milestone pharmaceuticals inc.": 388, "circonus": 389, "nanostics": 390, "datadog inc.": 391, "realtor.com": 392, "northwest bancshares inc.": 393, "inhibrx inc.": 394, "global e": 395, "isofol medical ab publ": 396, "north atlantic acquisition corporation": 397, "iac": 398, "trinexia middle east  india": 399, "diamond hill investment group inc.": 400, "ioneer": 401, "tradecentric": 402, "scholastic": 403, "spin master": 404, "whitehorse finance inc.": 405, "rebuilding together boston": 406, "ezgo technologies ltd.": 407, "agba acquisition limited": 408, "calamos investments": 409, "autonation inc.": 410, "sata group": 411, "medison pharma": 412, "nuvasive inc. globus medical": 413, "oncohost": 414, "vertical capital income fund": 415, "cinedigm corp.": 416, "ssr mining inc.": 417, "first community corporation": 418, "yunji inc.": 419, "elbit systems ltd": 420, "bioreference health llc": 421, "kessler topaz meltzer  check llp": 422, "healthcare trust inc.": 423, "dogness international corporation": 424, "blocksbridge consulting": 425, "index pharmaceuticals": 426, "himalaya therapeutics sezc": 427, "camtek ltd.": 428, "ceragon networks ltd": 429, "sharecare": 430, "inspira technologies": 431, "trevi therapeutics inc.": 432, "steakholder foods ltd.": 433, "lancaster colony corporation": 434, "viasat inc.": 435, "akso health group": 436, "construction partners inc.": 437, "cn energy group. inc.": 438, "airnet technology inc.": 439, "agm group holdings inc.": 440, "sp global": 441, "qualtek services inc.": 442, "datanomix": 443, "spar group inc.": 444, "moleculin biotech inc.": 445, "feedingnyc": 446, "seelos therapeutics inc.": 447, "pipeline medical": 448, "ever__glory international group inc.": 449, "wetrade group inc": 450, "julie  holleman llp": 451, "fuwei films": 452, "underrated": 453, "eolas capital": 454, "academy sports  outdoors": 455, "aikido pharma inc.": 456, "ucloudlink group inc.": 457, "byrna technologies inc.": 458, "lakeshore acquisition i corp.": 459, "the shaquille oneal foundation": 460, "sensiml corporation": 461, "pharming group n.v.": 462, "millerknoll": 463, "integrated ventures inc": 464, "music licensing inc.": 465, "interco": 466, "grand canyon education inc.": 467, "novidea": 468, "biolinerx ltd": 469, "harbour biomed": 470, "gtis partners": 471, "111 inc.": 472, "lendingtree.com": 473, "the joint corp.": 474, "aaon": 475, "leap therapeutics inc.": 476, "ty j. young wealth management": 477, "blue safari group acquisition corp": 478, "cogent communications holdings inc.": 479, "willamette valley vineyards": 480, "midwest holding inc.": 481, "viomi technology co. ltd": 482, "meten holding group ltd.": 483, "lendingtree inc.": 484, "first bancorp": 485, "wimi hologram cloud inc.": 486, "idexx laboratories inc.": 487, "mondelz international inc.": 488, "monument circle acquisition corp.": 489, "laureate education inc.": 490, "anavasi diagnostics": 491, "natures sunshine": 492, "erie indemnity company": 493, "caligan partners lp": 494, "clean eatz kitchen": 495, "energyhub": 496, "crocs inc.": 497, "hughes": 498, "youdao inc.": 499, "law offices of howard g. smith": 500, "morningstar inc.": 501, "hello group inc.": 502, "research and markets": 503, "the childrens place inc.": 504, "tzp strategies acquisition corp.": 505, "kingswood acquisition corp.": 506, "audiocodes": 507, "praava health": 508, "tractable": 509, "ditto": 510, "pangaea logistics solutions ltd.": 511, "cantex pharmaceuticals inc.": 512, "aep ohio": 513, "myhealthteam": 514, "seeing machines limited": 515, "quantum computing inc": 516, "oxo international": 517, "dnp select income fund inc.": 518, "papaya global": 519, "agnc investment corp.": 520, "hall of fame resort  entertainment company": 521, "so__young international inc.": 522, "robbins geller rudman  dowd llp": 523, "sera prognostics inc.": 524, "invaio sciences": 525, "liqtech international inc.": 526, "sheraton grand bengaluru whitefield hotel  convention center": 527, "principal real estate income fund": 528, "cbc group": 529, "aurora technology acquisition corp. dih technology ltd.": 530, "i__mab": 531, "curis inc.": 532, "driven brands": 533, "frito__lay north america": 534, "kla corporation": 535, "zillow inc. opendoor": 536, "electrolux group": 537, "alnylam pharmaceuticals": 538, "airbnb inc.": 539, "alithya": 540, "village farms international inc.": 541, "minapharm pharmaceuticals migentra gmbh": 542, "axon": 543, "raytheon technologies": 544, "glancy prongay  murray llp pomerantz llp": 545, "monteverde  associates pc": 546, "axcelis technologies inc.": 547, "neuroone medical technologies corporation": 548, "primis financial corp.": 549, "catalyst bancorp inc.": 550, "steel dynamics inc.": 551, "criteo": 552, "tork an essity brand": 553, "ags": 554, "mondelez international": 555, "virtus investment partners inc.": 556, "acurx pharmaceuticals inc.": 557, "naas": 558, "mongodb inc.": 559, "iridium communications inc.": 560, "blackline": 561, "scottscott attorneys at law and hagens berman sobol shapiro llp": 562, "chindata group": 563, "holzer  holzer llc": 564, "huntington bancshares inc.": 565, "enghouse systems limited": 566, "teleste corporation": 567, "ballard power systems inc.": 568, "sw seed company": 569, "dennys corporation": 570, "solareit": 571, "cincinnati financial corporation": 572, "hydro flask": 573, "nisun international enterprise development group co. ltd": 574, "smobler studios": 575, "first bancorp and grandsouth bancorporation": 576, "tyra biosciences inc.": 577, "comcast corporation": 578, "criteo corp": 579, "royal purple": 580, "current coins": 581, "aspen neuroscience inc.": 582, "luokung technology corp.": 583, "exact sciences corp": 584, "quadrant knowledge solutions": 585, "naver corporation": 586, "sunpower corp.": 587, "steakholder foods%ae ltd.": 588, "natural order acquisition corp.": 589, "faze clan": 590, "car iq": 591, "canopy growth corporation": 592, "populus financial group inc.": 593, "equifax inc.": 594, "financialbuzz.com": 595, "heritage financial corporation": 596, "remark holdings inc.": 597, "inmode ltd.": 598, "artmarket.com": 599, "cleanspark inc.": 600, "copart inc.": 601, "akeyless security": 602, "beltone": 603, "fgi industries ltd.": 604, "papa johns": 605, "hemcheck": 606, "cis insurance services llc": 607, "consensus cloud solutions": 608, "arcadia biosciences inc.": 609, "greencity acquisition corporation": 610, "rose hill acquisition corporation": 611, "amedisys": 612, "mind technology inc.": 613, "viking therapeutics inc.": 614, "trinity capital inc.": 615, "epicquest education group international limited": 616, "scibase": 617, "blue ocean technologies llc": 618, "crayfish bidco oy": 619, "pulmatrix inc.": 620, "kazia therapeutics limited": 621, "lipocine inc.": 622, "bp america": 623, "cresud s.a.c.i.f. y a.": 624, "cisco systems inc.": 625, "newborntown inc.": 626, "easysend": 627, "faro": 628, "phio pharmaceuticals corp.": 629, "montgomery county economic development corporation": 630, "berkshire hills bancorp inc.": 631, "eltek ltd.": 632, "viatris inc.": 633, "janone inc.": 634, "ww international inc.": 635, "halozyme therapeutics inc.": 636, "levi  korsinsky llp": 637, "zhongchao inc.": 638, "homepoint": 639, "glory star new media group holdings limited": 640, "synaptogenix inc.": 641, "corbus pharmaceuticals": 642, "zulily": 643, "accolade": 644, "exact sciences corporation": 645, "marine petroleum trust": 646, "emerson": 647, "zk international group co. ltd.": 648, "lindblad expeditions holdings inc.": 649, "microalgo inc.": 650, "home bancorp inc.": 651, "oncusp": 652, "proteantecs": 653, "heidrick  struggles international inc.": 654, "american healthcare reit inc.": 655, "criteo s.a.": 656, "lipella pharmaceuticals inc.": 657, "altair": 658, "linkbancorp inc.": 659, "abcam plc": 660, "weibo corporation": 661, "quicklogic corporation": 662, "first united corporation": 663, "high tide inc.": 664, "kaiju etf advisors": 665, "harmonic inc.": 666, "citizens financial services inc.": 667, "precision optics corporation": 668, "etf architect": 669, "inpixon": 670, "sirius xm holdings inc.": 671, "heron therapeutics": 672, "red canary": 673, "colliers": 674, "national grid renewables": 675, "devyser diagnostics ab": 676, "evogene": 677, "delcath systems inc.": 678, "umpqua holdings corporation": 679, "aarp services": 680, "doc popcorn": 681, "jll income property trust": 682, "rvngo": 683, "psychic source": 684, "berger montague": 685, "arena analytics": 686, "bite acquisition corp.": 687, "under armour inc.": 688, "amtrak": 689, "synchrony": 690, "belpointe prep llc": 691, "uatp": 692, "mufg": 693, "biocon biologics ltd": 694, "lion electric": 695, "energy harbor": 696, "flowers foods inc.": 697, "yalla group limited": 698, "nomad foods limited": 699, "royce investment partners": 700, "the timken company": 701, "donnelley financial solutions": 702, "centerline": 703, "choiceone financial services inc.": 704, "toms of maine": 705, "cvs health": 706, "dicks sporting goods inc.": 707, "kovitz investment group partners": 708, "stewart information services corporation": 709, "doble engineering company": 710, "kuona": 711, "dell technologies": 712, "stora enso oyj": 713, "qiming venture partners": 714, "troika media group inc.": 715, "select energy services inc.": 716, "artivion inc.": 717, "easterseals": 718, "audacy": 719, "one gas inc.": 720, "service corporation international": 721, "terex corporation": 722, "livaway suites": 723, "marathon oil corporation": 724, "brinker international payroll company l.p.": 725, "zenseact ab": 726, "ashley homestores ltd.": 727, "kx": 728, "visier": 729, "miniso group holding limited": 730, "crescent point energy corp.": 731, "accenture": 732, "generac power systems inc.": 733, "te connectivity ltd.": 734, "epic sciences": 735, "community healthcare trust inc.": 736, "essa pharma inc": 737, "delta children": 738, "canadian pacific": 739, "hydro one inc.": 740, "we energies": 741, "azz inc.": 742, "t. rowe price group inc.": 743, "enel north america": 744, "peoplescout": 745, "webster financial corporation": 746, "bristow group": 747, "greenbrook tms inc.": 748, "wabtec corporation": 749, "pomerantz llp": 750, "case ih": 751, "nikola corporation": 752, "avalon holdings corporation": 753, "sanctuary wealth": 754, "miniso": 755, "veeva systems": 756, "i__80 gold corp": 757, "quest diagnostics": 758, "g. willi__food international ltd.": 759, "kellogg company": 760, "ssc": 761, "unifirst corporation": 762, "nel asa": 763, "restaurant brands international inc.": 764, "waste connections inc.": 765, "amcor": 766, "fundamental global": 767, "mplx lp": 768, "protalix biotherapeutics inc.": 769, "starwood capital group": 770, "clearwater analytics llc": 771, "carrier": 772, "concord medical services holdings limited": 773, "cgi": 774, "princess cruises": 775, "salary.com inc.": 776, "element energy": 777, "jianpu technology inc.": 778, "sscamlp": 779, "air products": 780, "arkose labs": 781, "globalinvestmentdaily.com": 782, "kar auction services": 783, "yiren digital": 784, "gap": 785, "markel corporation": 786, "intocell": 787, "davita inc.": 788, "kuke music holding limited": 789, "lifespeak inc.": 790, "new england realty associates limited partnership": 791, "icertis": 792, "measureone": 793, "mallinckrodt plc": 794, "unavets group ares management": 795, "loancare": 796, "biglari holdings inc.": 797, "gsk plc": 798, "aercap holdings n.v.": 799, "ellomay capital ltd": 800, "phx minerals inc.": 801, "kbr inc.": 802, "biolinerx ltd.": 803, "lannett company inc.": 804, "worldatwork": 805, "holland america line": 806, "callaway golf": 807, "nabors energy transition corp.": 808, "channeladvisor corporation": 809, "adams resources  energy inc.": 810, "alabama power company": 811, "perrigo company plc": 812, "zogo": 813, "international space station national lab": 814, "fs kkr capital corp.": 815, "barings": 816, "v2x inc.": 817, "mercury insurance": 818, "home chef": 819, "freenome holdings inc.": 820, "emeren group ltd": 821, "cf bankshares inc.": 822, "capsida biotherapeutics": 823, "alliancebernstein": 824, "noah holdings limited": 825, "best inc.": 826, "vipshop": 827, "independence contract drilling inc.": 828, "oldcastle apg": 829, "party city holdco inc.": 830, "gogoro": 831, "automotivemastermind": 832, "saint louis university": 833, "dicks sporting goods": 834, "enbridge inc.": 835, "manning  napier inc.": 836, "life time inc.": 837, "sands china ltd.": 838, "rinchem": 839, "danaher corporation": 840, "verra mobility": 841, "carson group": 842, "craftsman": 843, "century 21 real estate llc": 844, "stanley black  decker": 845, "bmo financial group": 846, "msa safety": 847, "ascensia diabetes care": 848, "scholastic inc": 849, "oracle cerner": 850, "clear channel outdoor holdings inc.": 851, "infracap reit preferred etf": 852, "southern company": 853, "huntsman corporation": 854, "caterpillar foundation": 855, "agco": 856, "ketel one family made vodka": 857, "oppenheimer  co. inc.": 858, "hanza ab": 859, "cme group": 860, "getlabs": 861, "the sherwin__williams company": 862, "bausch  lomb corporation": 863, "old republic international corporation": 864, "promedica": 865, "select medical holdings corporation": 866, "nevro corp.": 867, "general dynamics": 868, "valvoline inc.": 869, "zim__asia": 870, "sentage holdings inc.": 871, "coldwell banker global luxury": 872, "extra space storage inc.": 873, "franks redhot": 874, "capital returns management llc": 875, "azure power": 876, "banco santander mxico s.a.": 877, "tuya inc.": 878, "virtus convertible  income fund ii": 879, "pedrosa richardson": 880, "leju holdings limited": 881, "harley__davidson inc.": 882, "trueblue": 883, "maaden": 884, "allegion us": 885, "pmv capital": 886, "ashford securities": 887, "latham  watkins": 888, "popable": 889, "remax llc": 890, "lm funding america": 891, "permian basin royalty trust": 892, "the wendys company": 893, "greif inc.": 894, "genesco inc.": 895, "seaworld entertainment inc.": 896, "north european oil royalty trust": 897, "kar global": 898, "vesta corporation": 899, "virtus convertible  income 2024 target term fund": 900, "federal realty investment trust": 901, "senmiao technology limited": 902, "tommy bahama": 903, "stellantis": 904, "savant systems inc.": 905, "wonder bread": 906, "peopleready": 907, "hawaiian electric industries inc.": 908, "doordash": 909, "protalix biotherapeutics inc. chiesi": 910, "bion environmental technologies inc.": 911, "hudson executive investment corp. ii": 912, "banco macro s.a.": 913, "enttelligence": 914, "mastercard latin america  the caribbean": 915, "expedient": 916, "franklinwh energy storage inc.": 917, "rowley law pllc": 918, "federal signal corporation": 919, "recon technology ltd": 920, "ardagh metal packaging s.a.": 921, "tetra technologies inc.": 922, "medifast": 923, "symphonyai": 924, "talking stick resort": 925, "mercury general corporation": 926, "globe life inc.": 927, "buchanans scotch whisky": 928, "big brothers big sisters of america": 929, "international institute of information technology __ hyderabad": 930, "51talk online education group": 931, "gerdau s.a.": 932, "imax corporation": 933, "kimberly__clark corporation": 934, "sempra infrastructure": 935, "wideopenwest inc.": 936, "synchrony financial": 937, "resolute forest products inc.": 938, "silvercorp metals inc": 939, "transdigm group inc.": 940, "lp building solutions": 941, "cgi federal inc.": 942, "first horizon corporation": 943, "delek us holdings inc. delek logistics partners lp": 944, "e__space": 945, "claimsfiler": 946, "parsons school of design roblox corporation": 947, "labaton sucharow llp": 948, "paradatec": 949, "farmer mac": 950, "confermed": 951, "mindgruve": 952, "movable ink": 953, "atrenew inc.": 954, "keycorp": 955, "communications data group": 956, "arcbest": 957, "td bank group": 958, "medtronic plc": 959, "equitable bank": 960, "royal caribbean group": 961, "jakubowitz law": 962, "dariohealth corp.": 963, "robokiller": 964, "shutterstock inc.": 965, "raytheon company": 966, "brinker international inc.": 967, "sasol limited": 968, "florida power  light company": 969, "hagens berman sobol shapiro llp": 970, "atlas corp.": 971, "solo stove": 972, "orkin llc": 973, "everi holdings inc.": 974, "pershing llc": 975, "renesola ltd.": 976, "microsoft corp.": 977, "cnx resources corporation": 978, "truist foundation": 979, "advanced drainage system inc.": 980, "encompass health corp.": 981, "changebridge capital": 982, "veritiv corporation": 983, "dominion energy": 984, "pcf insurance services": 985, "ntt data business solutions ag": 986, "lithia motors inc.": 987, "invesco mortgage capital inc.": 988, "dover": 989, "weber shandwick": 990, "wolverine": 991, "cartus corporation": 992, "frost  sullivan": 993, "cheetah mobile": 994, "denison mines corp.": 995, "frito__lay north america pepsico": 996, "cigna": 997, "toyota motor north america": 998, "pateo": 999, "ross acquisition corp ii": 1000, "applied value group": 1001, "truecar.com": 1002, "protos security": 1003, "clear": 1004, "stag industrial inc.": 1005, "capital one financial corporation": 1006, "nova": 1007, "nvr inc.": 1008, "finvolution group": 1009, "the hershey company": 1010, "manpowergroup": 1011, "faruqi  faruqi llp": 1012, "thor financial technologies": 1013, "planet fitness inc.": 1014, "fidelity  guaranty life": 1015, "sally beauty holdings inc.": 1016, "fuel cycle": 1017, "wynn resorts limited": 1018, "las vegas sands corp.": 1019, "cnx resources corporation new frontier aerospace inc.": 1020, "enerdel energy solutions": 1021, "networknewswire": 1022, "mccormick  company incorporated": 1023, "lucky brand": 1024, "cno financial group inc.": 1025, "schubert jonckheer  kolbe llp": 1026, "american college of radiology": 1027, "coopersurgical%ae": 1028, "victrola": 1029, "carrier global corporation": 1030, "davita": 1031, "marco polo exchange llc": 1032, "stoneridge inc.": 1033, "m3__brigade acquisition iii corp.": 1034, "inspire investing": 1035, "collins aerospace": 1036, "samuel adams": 1037, "privat 3 money": 1038, "avantor and financial news": 1039, "acucort ab": 1040, "cano health inc.": 1041, "ivalua": 1042, "lendingclub corporation": 1043, "taylor morrison": 1044, "fidelity national financial inc. fgl holdings": 1045, "thomson reuters": 1046, "entergy corporation": 1047, "paralel technologies": 1048, "clario": 1049, "moors  cabot investments": 1050, "karyopharm therapeutics inc.": 1051, "stone door group": 1052, "charles river data": 1053, "trilogy metals inc.": 1054, "boston scientific corporation": 1055, "wdiv__tv": 1056, "mews": 1057, "cameron lng": 1058, "alteryx inc.": 1059, "genuine parts company": 1060, "atif holdings limited": 1061, "norfolk southern corporation": 1062, "the oregon group": 1063, "clear channel outdoor": 1064, "deckers brands": 1065, "antero resources corporation": 1066, "universal air travel plan inc. uatp": 1067, "rlx technology inc.": 1068, "raven sr inc.": 1069, "the klein law firm": 1070, "authomize": 1071, "grifols": 1072, "radcom ltd.": 1073, "vail resorts inc.": 1074, "hyatt": 1075, "mettler__toledo international inc.": 1076, "the j.m. smucker co.": 1077, "group 1 automotive inc.": 1078, "moore kuehn pllc": 1079, "the aarons company inc.": 1080, "cadence bank": 1081, "yellow wood partners": 1082, "maslansky  partners": 1083, "preformed line products": 1084, "kbr": 1085, "ati physical therapy": 1086, "truemark investments": 1087, "marina maher communications": 1088, "ericsson": 1089, "noble corporation plc": 1090, "perceiv ai": 1091, "qubecor mdia inc.": 1092, "cohere health": 1093, "helix": 1094, "maserati": 1095, "cross timbers royalty trust": 1096, "build__a__bear workshop": 1097, "nu skin enterprises": 1098, "new york life investments": 1099, "securrency": 1100, "simmons first national corporation": 1101, "nelnet diversified services": 1102, "hilton": 1103, "w.w. grainger inc.": 1104, "cnx resources corporation ice thermal harvesting llc": 1105, "genyouth": 1106, "big lots inc.": 1107, "eminence capital lp": 1108, "allspring global investments": 1109, "foot locker inc.": 1110, "nordstrom inc.": 1111, "warburg pincus capital corporation i__a": 1112, "sp global sustainable1": 1113, "millennium space systems": 1114, "entreprenista media": 1115, "advanced drainage systems inc.": 1116, "sei investments company": 1117, "micro focus": 1118, "ppl corporation": 1119, "j.p. morgan": 1120, "leggett  platt": 1121, "financialnewsmedia.com": 1122, "winc inc.": 1123, "virtus funds": 1124, "ascenum inc.": 1125, "northwind group": 1126, "nexpoint diversified real estate trust": 1127, "wheels up": 1128, "phoenix investors": 1129, "fmc corporation": 1130, "standard motor products inc.": 1131, "leidos": 1132, "ihuman inc.": 1133, "kennametal inc.": 1134, "envista holdings corporation": 1135, "instructure": 1136, "healthlynked corp.": 1137, "medicus sciences acquisition corp.": 1138, "ahava productions": 1139, "enercom inc.": 1140, "framtiden management company llc": 1141, "sandridge energy inc.": 1142, "ellomay capital ltd.": 1143, "progressive insurance": 1144, "bell media": 1145, "ipipeline legal  general america": 1146, "ballys corporation": 1147, "visa": 1148, "carnival corporation  plc": 1149, "lexus": 1150, "climate real impact solutions ii acquisition corporation": 1151, "bank of america corporation": 1152, "braskem s.a.": 1153, "hypatia capital": 1154, "enova international inc.": 1155, "latino business action network": 1156, "paychex inc.": 1157, "coor": 1158, "fidelity national financial inc. fg annuities  life inc.": 1159, "matson inc.": 1160, "virtus diversified income  convertible fund": 1161, "bright scholar education holdings ltd.": 1162, "walker  dunlop investment partners inc.": 1163, "loews": 1164, "summit hotel properties inc.": 1165, "portland general company": 1166, "validic inc": 1167, "dominos pizza inc.": 1168, "china jo__jo drugstores inc.": 1169, "weyerhaeuser company": 1170, "msg sports llc": 1171, "the home depot": 1172, "aspen aerogels inc.": 1173, "skillstorm": 1174, "pizza hut": 1175, "rush street interactive": 1176, "cerebrumx labs inc.": 1177, "livent corporation": 1178, "gates industrial corporation plc": 1179, "kelly services inc.": 1180, "kentucky fried chicken": 1181, "deere  company": 1182, "mint eco car wash": 1183, "comerica incorporated": 1184, "panagram structured asset management": 1185, "ovintiv inc.": 1186, "green giant ltd": 1187, "tenneco inc.": 1188, "the risk management association": 1189, "taseko mines limited": 1190, "fast twitch": 1191, "chunghwa telecom": 1192, "agnico eagle mines limited": 1193, "designer brands inc.": 1194, "microland": 1195, "associated banc__corp": 1196, "pnm resources inc.": 1197, "fnf fgl holdings": 1198, "sp global mobility": 1199, "nextera energy resources": 1200, "blockchain coinvestors": 1201, "gold royalty corp.": 1202, "sp global market intelligence": 1203, "china eastern airlines": 1204, "firstenergy corp.": 1205, "decode health": 1206, "betmgm": 1207, "the kroger co.": 1208, "outfront media inc.": 1209, "amp": 1210, "mastech digital inc.": 1211, "im cannabis corp": 1212, "equipifi": 1213, "international brotherhood of teamsters": 1214, "rocket mortgage": 1215, "hdbaset alliance": 1216, "tbn fathom events impact productions": 1217, "chicos fas inc.": 1218, "rm law p.c.": 1219, "arlington asset investment corp.": 1220, "cushing%ae asset management lp": 1221, "mccormick  company inc.": 1222, "gigamedia": 1223, "weiss law": 1224, "alexandria real estate equities inc.": 1225, "alabama power": 1226, "international tower hill mines ltd.": 1227, "logituit": 1228, "kaleyra us": 1229, "koolaburra by ugg": 1230, "mean green": 1231, "darling ingredients inc.": 1232, "firstclose": 1233, "ace global business acquisition limited": 1234, "kaskela law llc": 1235, "houston natural resources corp": 1236, "petco love": 1237, "mclane company": 1238, "organon": 1239, "domino data lab": 1240, "generac grid services": 1241, "hillenbrand inc.": 1242, "cbiz inc.": 1243, "anterix inc.": 1244, "infracap mlp etf": 1245, "timkensteel corp.": 1246, "vitamin cottage natural food markets inc.": 1247, "eog resources inc.": 1248, "pseg": 1249, "cunard": 1250, "evernorth": 1251, "blockchain.com": 1252, "brown brothers harriman": 1253, "algonquin power  utilities corp.": 1254, "realnetworks inc.": 1255, "west fraser timber co. ltd.": 1256, "fg annuities  life inc.": 1257, "motional": 1258, "ibm": 1259, "plug and play": 1260, "primis": 1261, "rockwell automation": 1262, "international paper": 1263, "live nation entertainment": 1264, "minerva foods": 1265, "sunlands technology group": 1266, "tuya smart": 1267, "hsa bank": 1268, "vnue inc.": 1269, "diamond offshore drilling inc.": 1270, "virtus artificial intelligence  technology opportunities fund": 1271, "behr paint company": 1272, "union bank": 1273, "spire inc.": 1274, "stayntouch": 1275, "munters group ab": 1276, "loews hotels  co": 1277, "welltower inc.": 1278, "fullsteam holdings llc": 1279, "townsquare media inc.": 1280, "ostro": 1281, "alamo group inc.": 1282, "southern company nicor gas": 1283, "natural grocers by vitamin cottage inc.": 1284, "america__israel friendship league": 1285, "wells fargo advisors": 1286, "boomerangfx": 1287, "verana health": 1288, "bny mellon investor solutions": 1289, "the boston beer company inc.": 1290, "cherokee nation entertainment llc": 1291, "leeds equity partners llc": 1292, "darden restaurants inc. financial": 1293, "prime movers lab": 1294, "uber": 1295, "corteva inc.": 1296, "appian": 1297, "lg display": 1298, "cabo ftl systems lc": 1299, "welcome homes": 1300, "century communities inc.": 1301, "gross law firm": 1302, "sumitovant biopharma ltd. myovant sciences inc.": 1303, "chesapeake utilities corporation": 1304, "clough global dividend and income fund": 1305, "saul centers inc.": 1306, "uscellular": 1307, "adp inc.": 1308, "the cigna group": 1309, "seagrams 7 american blended whiskey": 1310, "new holland agriculture north america": 1311, "accesso technology group": 1312, "actinium pharmaceuticals inc.": 1313, "omnicom group inc.": 1314, "sola impact": 1315, "white mountains insurance group ltd.": 1316, "rosca scarlato llc": 1317, "nelnet inc.": 1318, "direct digital holdings": 1319, "bernstein liebhard llp": 1320, "flagship pioneering": 1321, "carsgen therapeutics": 1322, "bce inc.": 1323, "intercorp financial services inc.": 1324, "foot locker ir": 1325, "medwand solutions inc.": 1326, "union pacific corporation": 1327, "the hawthorn group l.c.": 1328, "the 22 fund": 1329, "meihua international medical technologies co. ltd.": 1330, "alaska air group": 1331, "hnr acquisition corp": 1332, "cnfinance holdings limited": 1333, "mainstay": 1334, "hertz global holdings inc.": 1335, "diageo": 1336, "pge corporation": 1337, "f.n.b. corporation": 1338, "flagstar bancorp inc.": 1339, "totalenergies": 1340, "fox corporation": 1341, "lowes companies inc.": 1342, "boqii holding limited": 1343, "afresh technologies": 1344, "bitt": 1345, "the last rockstars": 1346, "borgwarner": 1347, "venator materials plc": 1348, "full truck alliance co. ltd.": 1349, "d and z media": 1350, "ademi llp": 1351, "g squared ascend i inc.": 1352, "first high__school education group co. ltd": 1353, "the home depot foundation": 1354, "dingdong cayman limited": 1355, "waste management national services inc": 1356, "southern california gas company": 1357, "western union": 1358, "sempra": 1359, "the swiss helvetia fund inc.": 1360, "coopervision": 1361, "american public education inc.": 1362, "king abdulaziz center for world culture ithra": 1363, "peabody": 1364, "tusimple holdings inc.": 1365, "choice hotels international inc.": 1366, "hagerty": 1367, "energizer holdings inc.": 1368, "sp global commodity insights": 1369, "virtus total return fund": 1370, "clearwater analytics": 1371, "benchmark electronics inc.": 1372, "brp inc.": 1373, "amh": 1374, "topgolf callaway brands corp.": 1375, "resideo technologies inc.": 1376, "horizon technology finance corporation": 1377, "pnc financial services group inc.": 1378, "beasley allen law firm": 1379, "jll": 1380, "kenon holdings ltd.": 1381, "virtus total return fund inc.": 1382, "sequans communications": 1383, "essity": 1384, "playvox": 1385, "ameren missouri": 1386, "volitionrx limited": 1387, "teamsters local 104": 1388, "apkudo": 1389, "pan american silver corp.": 1390, "gold fields limited": 1391, "decisionpoint systems inc.": 1392, "invitae corporation": 1393, "waterford": 1394, "ing capital llc kamps inc.": 1395, "frankford candy": 1396, "arbor realty trust": 1397, "safehold": 1398, "diebold nixdorf incorporated": 1399, "herbalife nutrition": 1400, "nextier oilfield solutions": 1401, "macerich": 1402, "sabre corporation": 1403, "diamondrock hospitality company": 1404, "mediawan": 1405, "halper sadeh llp": 1406, "permrock royalty trust": 1407, "royal caribbean international": 1408, "dish network corporation": 1409, "qudian inc.": 1410, "spirit airlines inc.": 1411, "boom supersonic": 1412, "ase technology holding co. ltd.": 1413, "sedana medical": 1414, "cullenfrost bankers inc.": 1415, "la__z__boy southeast": 1416, "donnelley financial llc": 1417, "nexpoint real estate finance inc.": 1418, "nacco industries": 1419, "genpact": 1420, "thor industries": 1421, "schlage": 1422, "ecr software corporation": 1423, "sweet.io": 1424, "trip.com group": 1425, "tomorrow health": 1426, "scully royalty ltd.": 1427, "wisconsin electric power co.": 1428, "mississippi power": 1429, "goldmining inc.": 1430, "jack morton worldwide": 1431, "veris residential inc.": 1432, "henley  partners": 1433, "aetna": 1434, "the hanover insurance group inc.": 1435, "global x management company llc": 1436, "seadrill limited": 1437, "united states cellular corporation": 1438, "con edison of new york": 1439, "life time": 1440, "otis worldwide corporation": 1441, "universal corporation": 1442, "coldwell banker commercial affiliates": 1443, "simpson manufacturing co. inc.": 1444, "pratt  whitney": 1445, "john hancock investment management": 1446, "empaxis data management inc.": 1447, "envisagenics": 1448, "norgine b.v.": 1449, "allsteel": 1450, "the taiwan fund inc.": 1451, "towardex": 1452, "brixmor property group inc.": 1453, "flotek industries inc.": 1454, "southwest gas holdings inc.": 1455, "mohegan sun": 1456, "health net": 1457, "diamyd medical ab": 1458, "cdpq": 1459, "corning incorporated": 1460, "mufg bank ltd.": 1461, "chubb": 1462, "boll  branch": 1463, "elevat inc": 1464, "compass": 1465, "sun life u.s.": 1466, "tal education group": 1467, "zepp health corp.": 1468, "gohealth inc.": 1469, "core laboratories n.v.": 1470, "hidden valley ranch": 1471, "yum china holdings inc.": 1472, "consumer technology association": 1473, "health net inc.": 1474, "coldwell banker realty": 1475, "crown royal": 1476, "zim integrated shipping services ltd. and 40seas": 1477, "silicon valley bank": 1478, "nexgen energy ltd.": 1479, "zyversa therapeutics inc. larkspur health acquisition corp.": 1480, "grupo aeroportuario del sureste s.a.b. de c.v.": 1481, "shopee": 1482, "skillup coalition": 1483, "truly hard seltzer": 1484, "pharmaventures": 1485, "embraer s.a.": 1486, "lexisnexis risk solutions": 1487, "grubhub inc.": 1488, "lg energy solution": 1489, "charlottes web holdings inc.": 1490, "ideanomics": 1491, "nelnet renewable energy": 1492, "rollick": 1493, "summit midstream partners lp": 1494, "cloopen group holding limited": 1495, "palatin technologies inc.": 1496, "dorel juvenile group": 1497, "omnicom public relations group": 1498, "centerline drivers": 1499, "davita clinical research": 1500, "gep": 1501, "everfi inc.": 1502, "nuveen": 1503, "protiviti": 1504, "graphic packaging holding company": 1505, "chubb limited": 1506, "universal security instruments inc.": 1507, "evolent health": 1508, "haleon plc": 1509, "unisys corporation": 1510, "haemonetics corporation": 1511, "daqo new energy corp.": 1512, "penumbra inc.": 1513, "broadcom inc.": 1514, "bulleit frontier whiskey": 1515, "lument finance trust inc.": 1516, "ogilvy public relations worldwide": 1517, "envestnet": 1518, "pnc financial services group": 1519, "medifast inc.": 1520, "empire state realty trust inc.": 1521, "seaworld parks  entertainment": 1522, "tastemade": 1523, "association for financial professionals afp": 1524, "the burrell group": 1525, "radiant logistics inc.": 1526, "ardmore shipping corporation": 1527, "senlac ridge partners": 1528, "blue owl capital": 1529, "waterdrop inc.": 1530, "tanger factory outlet centers inc.": 1531, "marathon petroleum corporation": 1532, "the schall law firm": 1533, "burke  herbert bank": 1534, "element biosciences": 1535, "new energy equity": 1536, "robert half": 1537, "txu energy": 1538, "auto financial group": 1539, "quanta services inc.": 1540, "gartner": 1541, "anywhere real estate inc.": 1542, "dewalt": 1543, "fidelity  guaranty life fidelity national financial inc.": 1544, "red rock resorts inc.": 1545, "element etfs llc": 1546, "vulcan materials company": 1547, "tradestation securities inc.": 1548, "gamma biosciences": 1549, "godaddy inc.": 1550, "alibaba.com": 1551, "metalla royalty and streaming ltd.": 1552, "brelyon": 1553, "yatsen holding limited": 1554, "ati": 1555, "alphastruxure": 1556, "southwest airlines co.": 1557, "highland global allocation fund": 1558, "johnson controls international plc": 1559, "central pacific financial corp.": 1560, "regal rexnord corporation": 1561, "clarivate plc": 1562, "hennessy advisors inc.": 1563, "delta air lines": 1564, "starwood property trust inc.": 1565, "brain corp": 1566, "wood partners": 1567, "fusion pharmaceuticals inc.": 1568, "digital realty": 1569, "bpas inc": 1570, "salesforce": 1571, "waterfall asset management": 1572, "eqt corporation eqt__ir": 1573, "cohen  steers inc.": 1574, "the law offices of frank r. cruz los angeles": 1575, "continental resources": 1576, "denali capital acquisition corp.": 1577, "lufax holding ltd": 1578, "nisource inc.": 1579, "oppenheimer holdings inc.": 1580, "oracle": 1581, "abbott": 1582, "walker  dunlop inc.": 1583, "insignia capital group": 1584, "akastor asa": 1585, "newrocket": 1586, "pearl health": 1587, "hologenixllcunifi inc.": 1588, "oge energy corp.": 1589, "the orange county hispanic education endowment fund": 1590, "fiberon": 1591, "adient": 1592, "betmgm llc": 1593, "kps capital partners lp": 1594, "aflac": 1595, "renaissance bioscience corp.": 1596, "pbf energy inc.": 1597, "arcellx inc": 1598, "stifel independent advisors": 1599, "cango inc.": 1600, "ritchie bros.": 1601, "leaseaccelerator": 1602, "boeing": 1603, "combined insurance a chubb company": 1604, "kudu investment management": 1605, "msc industrial supply co.": 1606, "rosen law firm p.a.": 1607, "first industrial realty trust inc.": 1608, "carparts.com inc.": 1609, "kushner": 1610, "mgic investment corporation": 1611, "bbbsa": 1612, "the howard hughes corporation": 1613, "netease inc.": 1614, "fifth season investments": 1615, "agree realty corporation": 1616, "mtv entertainment studios": 1617, "federated hermes inc.": 1618, "infracap mlp etf virtus infracap u.s. preferred stock etf infracap reit preferred etf": 1619, "first citizens bancshares inc.": 1620, "nucor corporation": 1621, "carfax": 1622, "alaska air cargo": 1623, "arthur j. gallagher  co.": 1624, "prologis inc.": 1625, "aes corp.": 1626, "tbwaworldwide": 1627, "caterpillar inc.": 1628, "sun nuclear": 1629, "truist financial corporation": 1630, "nektar therapeutics": 1631, "u__haul holding company": 1632, "fgl holdings": 1633, "jbt corporation": 1634, "jacobs": 1635, "hormel foods corporation": 1636, "chicago rivet  machine co.": 1637, "banco bbva argentina s.a.": 1638, "mccune law group mccune wright arevalo vercoski kusel weck brandt apc": 1639, "figure": 1640, "women presidents organization": 1641, "opera limited": 1642, "titan international inc.": 1643, "marine products corporation": 1644, "cvs health corporation": 1645, "fleishmanhillard inc.": 1646, "union pacific railroad": 1647, "usa news group": 1648, "openloop health": 1649, "universal health services inc.": 1650, "mason graphite inc.": 1651, "main street capital corporation": 1652, "microcloud hologram inc.": 1653, "3m": 1654, "cibc": 1655, "sun life financial inc.": 1656, "cousins properties": 1657, "cgi inc.": 1658, "unum group": 1659, "eve holding inc.": 1660, "west pharmaceutical services inc.": 1661, "blue ridge bank n.a.": 1662, "hydro one limited": 1663, "velvet cichlid ab": 1664, "annovis bio": 1665, "parcel perform": 1666, "steel partners": 1667, "mdu resources group inc.": 1668, "longpath technologies inc.": 1669, "aqualung carbon capture": 1670, "web werks": 1671, "valueblue": 1672, "open text corporation": 1673, "jvm realty": 1674, "bloomberg": 1675, "the dow chemical company": 1676, "spark by hilton": 1677, "philips norelco": 1678, "riley exploration permian inc.": 1679, "lindsay corporation": 1680, "suncoke energy inc.": 1681, "astellas pharma inc.": 1682, "fomento economico mexicano s.a.b. de c.v.": 1683, "smirnoff": 1684, "abbvie": 1685, "prosperity bancshares inc.": 1686, "lyondellbasell industries": 1687, "global net lease inc.": 1688, "biocomposites": 1689, "barsele minerals corp.": 1690, "allen media group": 1691, "figure acquisition corp. i": 1692, "garmin ltd.": 1693, "autoliv": 1694, "remax holdings inc.": 1695, "the washington trust company": 1696, "general motors co.": 1697, "usana": 1698, "nachawati law group": 1699, "kahn swick  foti llc": 1700, "caesars entertainment inc.": 1701, "formtek inc.": 1702, "centene corporation": 1703, "nabors industries ltd.": 1704, "omnicom media group": 1705, "hearst television": 1706, "pneumagen": 1707, "berenson acquisition corp.": 1708, "dtf tax__free income 2028 term fund inc.": 1709, "ubs": 1710, "ashford hospitality trust inc.": 1711, "tradestation group inc.": 1712, "acres commercial realty corp.": 1713, "caliche development partners llc": 1714, "cardless": 1715, "vinfast automotive": 1716, "pacific gas and electric company": 1717, "bandwidth inc.": 1718, "minesto ab": 1719, "kimbell royalty partners lp": 1720, "modine manufacturing company": 1721, "honda": 1722, "istar inc.": 1723, "tequila don julio": 1724, "ddb worldwide": 1725, "securitize": 1726, "virtus convertible  income fund": 1727, "kennametal": 1728, "food allergy research  education": 1729, "century casinos inc.": 1730, "santander consumer usa holdings inc.": 1731, "cosmos group holdings inc.": 1732, "innovative rocket technologies inc.": 1733, "standex international corporation": 1734, "kingsway financial services inc.": 1735, "kuznicki law pllc": 1736, "gravitas education holdings inc.": 1737, "western copper and gold corporation": 1738, "squarespace inc.": 1739, "ball corporation": 1740, "cgi technologies and solutions inc.": 1741, "wheaton precious metals corp.": 1742, "delek logistics": 1743, "medibeacon inc.": 1744, "bloomingdales": 1745, "watt fuel cell": 1746, "cadiz inc.": 1747, "preit": 1748, "olin corporation": 1749, "loews corporation": 1750, "ysg": 1751, "new pacific metals corp.": 1752, "u.s. silica holdings inc.": 1753, "new gold inc.": 1754, "the greenbrier companies inc.": 1755, "southfield capital": 1756, "harford retirement planners": 1757, "globant": 1758, "vermilion energy inc.": 1759, "controladora vuela compania de aviacion s.a.b. de c.v. __ volaris": 1760, "silvercrest metals inc.": 1761, "jinkosolar 